app/controllers/categories_controller.rb

SELECT * FROM `categories` ORDER BY income desc
SELECT * FROM `items` WHERE (`items`.subcategory_id = 1 AND (month(date) = 7 and year(date) = 2009))
---
  def index
    @year = get_year(params)
    @month = get_month(params)

    @categories = Category.all(:order => "income desc")

    itens = Item.find_all_by_month_and_year(@month, @year)

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO `categories` (`name`, `created_at`, `updated_at`, `income`) VALUES('Renda familiar', '2009-07-24 20:17:27', '2009-07-24 20:17:27', 1)
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
UPDATE `categories` SET `updated_at` = '2009-07-24 21:19:46', `name` = 'Salários' WHERE `id` = 1
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT * FROM `categories` WHERE (`categories`.`id` = 3)
DELETE FROM `categories` WHERE `id` = 3
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy