app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT * FROM `items`

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)

  def new
		@subcategory = Subcategory.find(params[:subcategory_id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `subcategories` WHERE (`subcategories`.`id` = 1)

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 9)

  def create
    @item = Item.new(params[:item])
		@item.value = currency_to_number(params[:item][:value])
		@item.subcategory = Subcategory.find(params[:subcategory_id])

    year = Formater::extract_year(@item.date)
    month = Formater::extract_month(@item.date)

    @item.year = year
    @item.month = month

    respond_to do |format|
      if @item.save
---
SELECT * FROM `subcategories` WHERE (`subcategories`.`id` = 1)
INSERT INTO `items` (`name`, `created_at`, `updated_at`, `date`, `value`, `description`, `subcategory_id`) VALUES('Almoço', '2009-07-24 21:08:35', '2009-07-24 21:08:35', '2009-07-24', 18, 'Almoço no portal 4', NULL)

  def update
    @item = Item.find(params[:id])
		params[:item][:value] = currency_to_number(params[:item][:value])

    respond_to do |format|
      if @item.update_attributes(params[:item])
---
SELECT * FROM `items` WHERE (`items`.`id` = 9)
UPDATE `items` SET `updated_at` = '2009-07-25 00:28:35', `value` = 0.0 WHERE `id` = 4

  def destroy
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT * FROM `items` WHERE (`items`.`id` = 3)
DELETE FROM `items` WHERE `id` = 3