app/controllers/subcategories_controller.rb

  def new
    @subcategory = Subcategory.new
		@category = Category.find(params[:category_id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)

  def create
    @subcategory = Subcategory.new(params[:subcategory])
		@subcategory.category = Category.find(params[:category_id])

    respond_to do |format|
      if @subcategory.save
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `subcategories` WHERE (`subcategories`.`id` = 1)
INSERT INTO `subcategories` (`name`, `created_at`, `updated_at`, `category_id`) VALUES('Salários', '2009-07-24 20:36:16', '2009-07-24 20:36:16', NULL)

  def destroy
    @subcategory = Subcategory.find(params[:id])
    @subcategory.destroy
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `subcategories` WHERE (`subcategories`.`id` = 1)
DELETE FROM `categories` WHERE (`id` IN (5))
DELETE FROM `subcategories` WHERE `id` = 1