app/controllers/year_result_controller.rb

SELECT * FROM `categories` ORDER BY income desc
SELECT * FROM `items` WHERE (`items`.subcategory_id = 1 AND (month(date) = 7 and year(date) = 2009))
---
	def index
    @categories = Category.all(:order => "income desc")

    itens = Item.find_all_by_year(Date.current.year)